anthropic.claude-code
bierner.markdown-mermaid
dbaeumer.vscode-eslint
eamodio.gitlens
esbenp.prettier-vscode
galkowskit.go-interface-annotations
github.copilot-chat
github.vscode-github-actions
golang.go
joshmu.periscope
mads-hartmann.bash-ide-vscode
mhutchie.git-graph
ms-azuretools.vscode-containers
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.makefile-tools
ms-vscode.remote-explorer
nomicfoundation.hardhat-solidity
oven.bun-vscode
redhat.java
redhat.vscode-yaml
ritwickdey.liveserver
s-hiraoku.vscode-sidebar-terminal
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vscode-icons-team.vscode-icons
vue.volar
