cmstead.js-codeformer
cmstead.jsrefactor
codeium.windsurfpyright
dbaeumer.vscode-eslint
eamodio.gitlens
esbenp.prettier-vscode
evgeniypeshkov.syntax-highlighter
formulahendry.code-runner
github.copilot
github.copilot-chat
golang.go
grapecity.gc-excelviewer
hediet.vscode-drawio
illixion.vscode-vibrancy-continued
joshmu.periscope
mads-hartmann.bash-ide-vscode
mhutchie.git-graph
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.extension-test-runner
ms-vscode.remote-explorer
phil294.git-log--graph
redhat.vscode-yaml
ritwickdey.liveserver
streetsidesoftware.code-spell-checker
vscode-icons-team.vscode-icons
vsls-contrib.codetour
vue.volar
wayou.vscode-todo-highlight
xabikos.javascriptsnippets